---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyString.Value
source: html/c8d16b0e-542a-1fdc-49dd-bf96629dc1e2.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyString.Value Property

value of the property

## Syntax (C#)
```csharp
public string Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyString property.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.